"""
Тренировочное задание по программированию: 100 раз подряд в квадрате

Заданное число N записали 100 раз подряд и затем возвели в квадрат.
Что получилось?

Формат ввода:
Вводится целое неотрицательное число N не превышающее 1000.

Формат вывода:
Выведите ответ на задачу.
"""

print(int(input() * 100) ** 2)
