"""
Задание по программированию: Первая цифра двузначного числа

Дано положительное двузначное число. Найдите число десятков в нем.

Формат ввода
Вводится единственное число (гарантируется, что оно соответствует условию задачи).

Формат вывода
Выведите ответ на задачу.
"""

print(int(input()) // 10)
